<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"57e9d8ef1f5556393bdd132eb3323c9f18ad58920d6aebd874eb88a6426cab07","plan_job_ref":"Job Write Terraform Plan to Pull Request #43 at https://github.com/hackforla/devops-security/actions/runs/9098907125","plan_out_hash":"aff01155ded7077d667e577e87c4948447af3a95255807ec0e5497df7fc40d55","plan_hash":"a11aa910226f3b13d695cf936781b94f3f35230e54e79f4d565f44231db9df3d","plan_text_format":"diff","version":"1.42.0"} -->
Terraform plan in __terraform__
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.iam_user_tylerthome.aws_iam_user_login_profile.user_login will be created
+   resource "aws_iam_user_login_profile" "user_login" {
+       encrypted_password      = (known after apply)
+       id                      = (known after apply)
+       key_fingerprint         = (known after apply)
+       password                = (known after apply)
+       password_length         = 20
+       password_reset_required = true
+       user                    = "tyler.thome"
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Write Terraform Plan to Pull Request #43](https://github.com/hackforla/devops-security/actions/runs/9098907125)